Ran Plan for 3 projects:

1. dir: `bruno-athaide-product-test/caio-config` workspace: `default`
1. dir: `bruno-athaide-product-test/main-config` workspace: `default`
1. dir: `bruno-athaide-product-test/shared` workspace: `default`
---

### 1. dir: `bruno-athaide-product-test/caio-config` workspace: `default`
<details><summary>Show Output</summary>

```diff
data.configcat_products.my_products: Reading...
data.configcat_organizations.my_organizations: Reading...
data.configcat_organizations.my_organizations: Read complete after 0s [id=1755874590]
data.configcat_products.my_products: Read complete after 1s [id=1755874590]
data.configcat_configs.my_configs: Reading...
data.configcat_environments.my_environments: Reading...
data.configcat_environments.my_environments: Read complete after 0s [id=08ddc62b-f5b3-46de-86fb-342d26c74a4d1755874590]
data.configcat_configs.my_configs: Read complete after 0s [id=08ddc62b-f5b3-46de-86fb-342d26c74a4d1755874590]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # configcat_setting.advanced_config will be created
+ resource "configcat_setting" "advanced_config" {
      + config_id    = "08ddd116-c60d-4fb3-8eca-6b46df96c21c"
      + hint         = "Complex nested configuration stored as JSON string"
      + id           = (known after apply)
      + key          = "advancedConfiguration"
      + name         = "Advanced System Configuration"
      + order        = 9
      + setting_type = "string"
    }

  # configcat_setting.discount_percentage will be created
+ resource "configcat_setting" "discount_percentage" {
      + config_id    = "08ddd116-c60d-4fb3-8eca-6b46df96c21c"
      + hint         = "Precise discount percentage for promotions"
      + id           = (known after apply)
      + key          = "discountPercentage"
      + name         = "Discount Percentage"
      + order        = 7
      + setting_type = "double"
    }

  # configcat_setting.feature_limits will be created
+ resource "configcat_setting" "feature_limits" {
      + config_id    = "08ddd116-c60d-4fb3-8eca-6b46df96c21c"
      + hint         = "Various integer limits for feature usage"
      + id           = (known after apply)
      + key          = "featureLimits"
      + name         = "Feature Usage Limits"
      + order        = 8
      + setting_type = "int"
    }

  # configcat_setting.html_banner will be created
+ resource "configcat_setting" "html_banner" {
      + config_id    = "08ddd116-c60d-4fb3-8eca-6b46df96c21c"
      + hint         = "Rich HTML content for promotional banners"
      + id           = (known after apply)
      + key          = "htmlBannerContent"
      + name         = "HTML Banner Content"
      + order        = 6
      + setting_type = "string"
    }

  # configcat_setting.is_awesome will be created
+ resource "configcat_setting" "is_awesome" {
      + config_id    = "08ddd116-c60d-4fb3-8eca-6b46df96c21c"
      + hint         = "this is the hint for my awesome feature flag"
      + id           = (known after apply)
      + key          = "isMyAwesomeFeatureEnabled"
      + name         = "My awesome feature flag"
      + order        = 1
      + setting_type = "boolean"
    }

  # configcat_setting.large_config will be created
+ resource "configcat_setting" "large_config" {
      + config_id    = "08ddd116-c60d-4fb3-8eca-6b46df96c21c"
      + hint         = "Testing very large configuration strings"
      + id           = (known after apply)
      + key          = "largeConfiguration"
      + name         = "Large Configuration"
      + order        = 11
      + setting_type = "string"
    }

  # configcat_setting.long_description will be created
+ resource "configcat_setting" "long_description" {
      + config_id    = "08ddd116-c60d-4fb3-8eca-6b46df96c21c"
      + hint         = "Testing very long string values"
      + id           = (known after apply)
      + key          = "longDescription"
      + name         = "Long Description Field"
      + order        = 10
      + setting_type = "string"
    }

  # configcat_setting.max_items_per_page will be created
+ resource "configcat_setting" "max_items_per_page" {
      + config_id    = "08ddd116-c60d-4fb3-8eca-6b46df96c21c"
      + hint         = "Controls pagination size in list views"
      + id           = (known after apply)
      + key          = "maxItemsPerPage"
      + name         = "Maximum Items Per Page"
      + order        = 4
      + setting_type = "int"
    }

  # configcat_setting.price_multiplier will be created
+ resource "configcat_setting" "price_multiplier" {
      + config_id    = "08ddd116-c60d-4fb3-8eca-6b46df96c21c"
      + hint         = "Dynamic pricing multiplier for A/B testing"
      + id           = (known after apply)
      + key          = "priceMultiplier"
      + name         = "Price Multiplier"
      + order        = 3
      + setting_type = "double"
    }

  # configcat_setting.ui_configuration will be created
+ resource "configcat_setting" "ui_configuration" {
      + config_id    = "08ddd116-c60d-4fb3-8eca-6b46df96c21c"
      + hint         = "JSON-like configuration for UI components stored as string"
      + id           = (known after apply)
      + key          = "uiConfiguration"
      + name         = "UI Configuration"
      + order        = 5
      + setting_type = "string"
    }

  # configcat_setting.welcome_message will be created
+ resource "configcat_setting" "welcome_message" {
      + config_id    = "08ddd116-c60d-4fb3-8eca-6b46df96c21c"
      + hint         = "Customizable welcome message for users"
      + id           = (known after apply)
      + key          = "userWelcomeMessage"
      + name         = "User Welcome Message"
      + order        = 2
      + setting_type = "string"
    }

  # configcat_setting_value.advanced_config_value will be created
+ resource "configcat_setting_value" "advanced_config_value" {
      + environment_id = "08ddc62c-0cc2-43e7-8f61-400953081bfe"
      + id             = (known after apply)
      + init_only      = true
      + setting_id     = (known after apply)
      + setting_type   = (known after apply)
      + value          = jsonencode(
            {
              + api        = {
                  + endpoints = [
                      + "/users",
                      + "/products",
                      + "/orders",
                    ]
                  + rateLimit = {
                      + requests = 1000
                      + window   = "1h"
                    }
                  + version   = "v2"
                }
              + cache      = {
                  + enabled    = true
                  + strategies = [
                      + "lru",
                      + "ttl",
                    ]
                  + ttl        = 3600
                }
              + monitoring = {
                  + alerts  = {
                      + cpu_threshold    = 80
                      + memory_threshold = 85
                    }
                  + metrics = [
                      + "cpu",
                      + "memory",
                      + "disk",
                    ]
                }
            }
        )
    }

  # configcat_setting_value.discount_percentage_value will be created
+ resource "configcat_setting_value" "discount_percentage_value" {
      + environment_id = "08ddc62c-0cc2-43e7-8f61-400953081bfe"
      + id             = (known after apply)
      + init_only      = true
      + setting_id     = (known after apply)
      + setting_type   = (known after apply)
      + value          = "12.75"
    }

  # configcat_setting_value.feature_limits_value will be created
+ resource "configcat_setting_value" "feature_limits_value" {
      + environment_id = "08ddc62c-0cc2-43e7-8f61-400953081bfe"
      + id             = (known after apply)
      + init_only      = true
      + setting_id     = (known after apply)
      + setting_type   = (known after apply)
      + value          = "1000"
    }

  # configcat_setting_value.html_banner_value will be created
+ resource "configcat_setting_value" "html_banner_value" {
      + environment_id = "08ddc62c-0cc2-43e7-8f61-400953081bfe"
      + id             = (known after apply)
      + init_only      = true
      + setting_id     = (known after apply)
      + setting_type   = (known after apply)
      + value          = "<div class='banner'><h2>🎉 New Feature Available!</h2><p>Try our enhanced dashboard today.</p></div>"
    }

  # configcat_setting_value.large_config_value will be created
+ resource "configcat_setting_value" "large_config_value" {
      + environment_id = "08ddc62c-0cc2-43e7-8f61-400953081bfe"
      + id             = (known after apply)
      + init_only      = true
      + setting_id     = (known after apply)
      + setting_type   = (known after apply)
      + value          = jsonencode(
            {
              + data     = {
                  + orders   = {
                      + fields     = [
                          + "id",
                          + "user_id",
                          + "items",
                          + "total",
                          + "status",
                          + "created_at",
                          + "shipping_address",
                          + "billing_address",
                          + "payment_method",
                          + "notes",
                        ]
                      + validation = {
                          + required  = [
                              + "id",
                              + "user_id",
                              + "items",
                              + "total",
                            ]
                          + total_min = 0.01
                        }
                    }
                  + products = {
                      + fields     = [
                          + "id",
                          + "name",
                          + "description",
                          + "price",
                          + "category",
                          + "tags",
                          + "inventory",
                          + "supplier",
                          + "ratings",
                          + "reviews",
                        ]
                      + validation = {
                          + price_max = 999999.99
                          + price_min = 0.01
                          + required  = [
                              + "id",
                              + "name",
                              + "price",
                            ]
                        }
                    }
                  + users    = {
                      + fields     = [
                          + "id",
                          + "name",
                          + "email",
                          + "role",
                          + "created_at",
                          + "updated_at",
                          + "last_login",
                          + "status",
                          + "preferences",
                          + "metadata",
                        ]
                      + validation = {
                          + email_format    = true
                          + name_max_length = 100
                          + name_min_length = 2
                          + required        = [
                              + "id",
                              + "name",
                              + "email",
                            ]
                        }
                    }
                }
              + settings = {
                  + notifications = {
                      + email   = true
                      + push    = true
                      + sms     = false
                      + webhook = true
                    }
                  + pagination    = {
                      + default_page_size = 20
                      + max_page_size     = 100
                      + page_size_options = [
                          + 10,
                          + 20,
                          + 50,
                          + 100,
                        ]
                    }
                  + search        = {
                      + enabled          = true
                      + highlight        = true
                      + max_results      = 1000
                      + min_query_length = 2
                    }
                }
            }
        )
    }

  # configcat_setting_value.long_description_value will be created
+ resource "configcat_setting_value" "long_description_value" {
      + environment_id = "08ddc62c-0cc2-43e7-8f61-400953081bfe"
      + id             = (known after apply)
      + init_only      = true
      + setting_id     = (known after apply)
      + setting_type   = (known after apply)
      + value          = "This is a very long description that tests the maximum length limits of ConfigCat string settings. It contains multiple sentences and should help validate how the system handles large text content. We're testing various edge cases including special characters, numbers, and punctuation marks. The goal is to understand the limitations and behavior of the Terraform provider when dealing with complex string values."
    }

  # configcat_setting_value.max_items_per_page_value will be created
+ resource "configcat_setting_value" "max_items_per_page_value" {
      + environment_id = "08ddc62c-0cc2-43e7-8f61-400953081bfe"
      + id             = (known after apply)
      + init_only      = true
      + setting_id     = (known after apply)
      + setting_type   = (known after apply)
      + value          = "50"
    }

  # configcat_setting_value.price_multiplier_value will be created
+ resource "configcat_setting_value" "price_multiplier_value" {
      + environment_id = "08ddc62c-0cc2-43e7-8f61-400953081bfe"
      + id             = (known after apply)
      + init_only      = true
      + setting_id     = (known after apply)
      + setting_type   = (known after apply)
      + value          = "1.25"
    }

  # configcat_setting_value.setting_value will be created
+ resource "configcat_setting_value" "setting_value" {
      + environment_id = "08ddc62c-0cc2-43e7-8f61-400953081bfe"
      + id             = (known after apply)
      + init_only      = true
      + setting_id     = (known after apply)
      + setting_type   = (known after apply)
      + value          = "false"
    }

  # configcat_setting_value.ui_configuration_value will be created
+ resource "configcat_setting_value" "ui_configuration_value" {
      + environment_id = "08ddc62c-0cc2-43e7-8f61-400953081bfe"
      + id             = (known after apply)
      + init_only      = true
      + setting_id     = (known after apply)
      + setting_type   = (known after apply)
      + value          = jsonencode(
            {
              + features = {
                  + export  = false
                  + filters = true
                  + search  = true
                }
              + layout   = "sidebar"
              + limits   = {
                  + maxResults = 100
                  + timeout    = 30
                }
              + theme    = "dark"
            }
        )
    }

  # configcat_setting_value.welcome_message_value will be created
+ resource "configcat_setting_value" "welcome_message_value" {
      + environment_id = "08ddc62c-0cc2-43e7-8f61-400953081bfe"
      + id             = (known after apply)
      + init_only      = true
      + setting_id     = (known after apply)
      + setting_type   = (known after apply)
      + value          = "Welcome to our amazing platform!"
    }

Plan: 22 to add, 0 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d bruno-athaide-product-test/caio-config
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://617d36dbbc68.ngrok-free.app/lock?id=caioq%252Fpoc-configcat-atlantis%252Fbruno-athaide-product-test%252Fcaio-config%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d bruno-athaide-product-test/caio-config
  ```
Plan: 22 to add, 0 to change, 0 to destroy.

---
### 2. dir: `bruno-athaide-product-test/main-config` workspace: `default`
<details><summary>Show Output</summary>

```diff
data.configcat_products.my_products: Reading...
data.configcat_organizations.my_organizations: Reading...
data.configcat_organizations.my_organizations: Read complete after 1s [id=1755874593]
data.configcat_products.my_products: Read complete after 1s [id=1755874593]
data.configcat_configs.my_configs: Reading...
data.configcat_environments.my_environments: Reading...
data.configcat_configs.my_configs: Read complete after 0s [id=08ddc62b-f5b3-46de-86fb-342d26c74a4d1755874594]
data.configcat_environments.my_environments: Read complete after 0s [id=08ddc62b-f5b3-46de-86fb-342d26c74a4d1755874594]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # configcat_setting.is_amazing will be created
+ resource "configcat_setting" "is_amazing" {
      + config_id    = "08ddc62c-9e9a-4345-8405-693bbec66476"
      + hint         = "this is the hint for my amazing feature flag"
      + id           = (known after apply)
      + key          = "isMyAmazingFeatureEnabled"
      + name         = "My amazing feature flag"
      + order        = 1
      + setting_type = "boolean"
    }

  # configcat_setting_value.setting_value will be created
+ resource "configcat_setting_value" "setting_value" {
      + environment_id = "08ddc62c-0cc2-43e7-8f61-400953081bfe"
      + id             = (known after apply)
      + init_only      = true
      + setting_id     = (known after apply)
      + setting_type   = (known after apply)
      + value          = "false"
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d bruno-athaide-product-test/main-config
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://617d36dbbc68.ngrok-free.app/lock?id=caioq%252Fpoc-configcat-atlantis%252Fbruno-athaide-product-test%252Fmain-config%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d bruno-athaide-product-test/main-config
  ```
Plan: 2 to add, 0 to change, 0 to destroy.

---
### 3. dir: `bruno-athaide-product-test/shared` workspace: `default`
```diff
Changes to Outputs:
+ configcat_product_name = "Bruno Athaide Product Test"

You can apply this plan to save these new output values to the Terraform
state, without changing any real infrastructure.
```

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d bruno-athaide-product-test/shared
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://617d36dbbc68.ngrok-free.app/lock?id=caioq%252Fpoc-configcat-atlantis%252Fbruno-athaide-product-test%252Fshared%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d bruno-athaide-product-test/shared
  ```

---
### Plan Summary

3 projects, 3 with changes, 0 with no changes, 0 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```